performance/main.yml
config:
  target: "http://127.0.0.1:8000"
  http:    
    pool: 200 
    timeout: 10
    maxSockets: 200
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 300
      name: "Warm up"
    - duration: 300
      arrivalRate: 500
      name: "Sustained high load" 
  #payload:
  #  path: "./data/test-data.csv"
  #  fields:
  #    - "sessionId"
  #  order: cyclic
scenarios:
  - name: "Send analytical event"
    flow:
      - post:
          url: "/"          
          headers:
            Connection: "keep-alive"
          json:
            type: "load_test_event"  
            payload:                
              sessionId: "{{ sessionId }}"
              browser: "Chrome"
              performance: "tested"